using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Lab2
{
    public class Code
    {
        public Dictionary<string, string> code = new Dictionary<string, string>()
        {
            [" "] = "32",
            ["0"] = "48",
            ["1"] = "49",
            ["2"] = "50",
            ["3"] = "51",
            ["4"] = "52",
            ["5"] = "53",
            ["6"] = "54",
            ["7"] = "55",
            ["8"] = "56",
            ["9"] = "57",
            ["A"] = "65",
            ["B"] = "66",
            ["C"] = "67",
            ["D"] = "68",
            ["E"] = "69",
            ["F"] = "70",
            ["G"] = "71",
            ["H"] = "72",
            ["I"] = "73",
            ["J"] = "74",
            ["K"] = "75",
            ["L"] = "76",
            ["M"] = "77",
            ["N"] = "78",
            ["O"] = "79",
            ["P"] = "80",
            ["Q"] = "81",
            ["R"] = "82",
            ["S"] = "83",
            ["T"] = "84",
            ["U"] = "85",
            ["V"] = "86",
            ["W"] = "87",
            ["X"] = "88",
            ["Y"] = "89",
            ["Z"] = "90",
            ["a"] = "97",
            ["b"] = "98",
            ["c"] = "99",
            ["d"] = "100",
            ["e"] = "101",
            ["f"] = "102",
            ["g"] = "103",
            ["h"] = "104",
            ["i"] = "105",
            ["j"] = "106",
            ["k"] = "107",
            ["l"] = "108",
            ["m"] = "109",
            ["n"] = "110",
            ["o"] = "111",
            ["p"] = "112",
            ["q"] = "113",
            ["r"] = "114",
            ["s"] = "115",
            ["t"] = "116",
            ["u"] = "117",
            ["v"] = "118",
            ["w"] = "119",
            ["x"] = "120",
            ["y"] = "121",
            ["z"] = "122",
            ["А"] = "128",
            ["Б"] = "129",
            ["В"] = "130",
            ["Г"] = "131",
            ["Д"] = "132",
            ["Е"] = "133",
            ["Ё"] = "240",
            ["Ж"] = "134",
            ["З"] = "135",
            ["И"] = "136",
            ["Й"] = "137",
            ["К"] = "138",
            ["Л"] = "139",
            ["М"] = "140",
            ["Н"] = "141",
            ["О"] = "142",
            ["П"] = "143",
            ["Р"] = "144",
            ["С"] = "145",
            ["Т"] = "146",
            ["У"] = "147",
            ["Ф"] = "148",
            ["Х"] = "149",
            ["Ц"] = "150",
            ["Ч"] = "151",
            ["Ш"] = "152",
            ["Щ"] = "153",
            ["Ъ"] = "154",
            ["Ы"] = "155",
            ["Ь"] = "156",
            ["Э"] = "157",
            ["Ю"] = "158",
            ["Я"] = "159",
            ["а"] = "160",
            ["б"] = "161",
            ["в"] = "162",
            ["г"] = "163",
            ["д"] = "164",
            ["е"] = "165",
            ["ё"] = "241",
            ["ж"] = "166",
            ["з"] = "167",
            ["и"] = "168",
            ["й"] = "169",
            ["к"] = "170",
            ["л"] = "171",
            ["м"] = "172",
            ["н"] = "173",
            ["о"] = "174",
            ["п"] = "175",
            ["р"] = "224",
            ["с"] = "225",
            ["т"] = "226",
            ["у"] = "227",
            ["ф"] = "228",
            ["х"] = "229",
            ["ц"] = "230",
            ["ч"] = "231",
            ["ш"] = "232",
            ["щ"] = "233",
            ["ъ"] = "234",
            ["ы"] = "235",
            ["ь"] = "326",
            ["э"] = "237",
            ["ю"] = "238",
            ["я"] = "239",
        };
        public string CharCode(char ch)
        {
            return code[ch.ToString()];
        }
        public string CharDecode(string str)
        {

            return code.FirstOrDefault(x => x.Value == Convert.ToInt32(str, 2).ToString()).Key;
        }
        public string StrCode(string str)
        {
            if (str == "") return "Пустая строка";
            string output = "";
            string ou = "";
            foreach (char ch in str)
            {
                try
                {
                    ou += CharCode(ch) + " ";
                }
                catch { return "Что-то введено неправильно"; }

            }
            return ou;
        }
        public string StrDecode(string str)
        {
            string[] input = str.Split(" ");
            string output = "";
            foreach (string st in input) output += CharDecode(st);
            return output;
        }
    }
}
